article/004_seven_fallacy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2024-03-25 Mon 00:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>殷海光总结的七种谬误</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="panshishuo" />
<link rel="icon" href="/panshi/favicon.ico" type="image/vnd.microsoft.icon"/><link rel="stylesheet" type="text/css" href="/panshi/style.css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-home-and-up">
 <a accesskey="h" href="/panshi/sitemap.html"> 索引 </a>
 |
 <a accesskey="H" href="/panshi"> 主页 </a>
 |
 <a accesskey="" href="/panshi/pics.html"> 图集 </a>
 |
 <a accesskey="" href="https://github.com/xingangshi" target="_blank"> GITHUB </a>
 |
 <a accesskey="" href="https://www.shixingang.com/diary/" target="_blank"> 随笔 </a>
 |
 <a accesskey="" href="https://www.geekpanshi.com/" target="_blank"> 旧博客 </a>
 |
 <a><input type="text" class="st-default-search-input" placeholder="站内搜索..."/></a>
</div>
<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
  (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
  e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install','-7xxk_zZkMGeYu7EHZqk','2.0.0');
</script>

<script src="https://cdn.bootcss.com/vue/2.6.11/vue.min.js"></script>
</div>
<div id="content">
<h1 class="title">殷海光总结的七种谬误</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgafab50f">诉诸群众</a></li>
<li><a href="#org9e91c81">诉诸权威</a></li>
<li><a href="#org522b6c5">诉诸暴力</a></li>
<li><a href="#org2fd0f75">诉诸怜悯</a></li>
<li><a href="#org3176df4">人身攻击</a></li>
<li><a href="#org849a8f3">以自我为中心</a></li>
<li><a href="#org104a455">过分简单</a></li>
<li><a href="#org0488dd3">小结</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
在 <a href="https://item.jd.com/12403813.html">《逻辑新引：怎样判别是非》（殷海光 著）</a> 中，殷海光首先用一章的内容，告诉我们谬误有哪些。或者说，造成谬误的原因以及方式，有哪几种？殷海光归类为一下七种：
</p>
</blockquote>

<div id="outline-container-orgafab50f" class="outline-2">
<h2 id="orgafab50f">诉诸群众</h2>
<div class="outline-text-2" id="text-orgafab50f">
<p>
第一种，叫“诉诸群众”。
</p>

<p>
也就是我们常常听到的“多数乃真理的标准”，这种情况在历史上太多了，好比伽利略支持哥白尼的日心说，当时教廷的人就说，我们所有人以及我们以前的所有人都相信太阳绕地球转，所以伽利略的学说肯定是错的。当时一万个农民的科学知识也比不上一个伽利略。如果这个成立的话，那中国人说什么都是真理，我们人口最多啊，对不对？
</p>
</div>
</div>

<div id="outline-container-org9e91c81" class="outline-2">
<h2 id="org9e91c81">诉诸权威</h2>
<div class="outline-text-2" id="text-org9e91c81">
<p>
第二种，叫“诉诸权威”。
</p>

<p>
在一个没有被启蒙的社会，权威特别奏效。权威当然不能没有，但是如果整个社会只有一个权威，那可就糟糕了。知识爆炸以来，又不是亚里士多德、达·芬奇的年代，达·芬奇可以是各种家 &#x2013; 画家、作家、数学家、科学家、医学家……，你今天行吗？今天已经是“多元权威”的年代，所以千万别相信外行的“权威”说的话，听说一个人是权威，要问问是什么权威。
</p>
</div>
</div>

<div id="outline-container-org522b6c5" class="outline-2">
<h2 id="org522b6c5">诉诸暴力</h2>
<div class="outline-text-2" id="text-org522b6c5">
<p>
第三种，叫“诉诸暴力”。
</p>

<p>
中国人有句古话叫“秀才遇到兵，有理说不清”，这招太厉害了！如果没道理，我们可以用暴力建构出一个道理。古代的土匪流寇，最喜欢打一个旗号叫“替天行道”，有了这个护身符，杀人就可以理直气壮了。借助暴力巩固真理在一定的时空内是管用的，二战的时候丘吉尔向斯大林提议一起去说服教皇参战，斯大林很鄙视地问：“教皇有多少军队？”
</p>
</div>
</div>

<div id="outline-container-org2fd0f75" class="outline-2">
<h2 id="org2fd0f75">诉诸怜悯</h2>
<div class="outline-text-2" id="text-org2fd0f75">
<p>
第四种，叫“诉诸怜悯”。
</p>

<p>
就是说，哎呀，我虽然没有什么道理吧，但是我的心是好的呀。
</p>
</div>
</div>

<div id="outline-container-org3176df4" class="outline-2">
<h2 id="org3176df4">人身攻击</h2>
<div class="outline-text-2" id="text-org3176df4">
<p>
第五种，叫“人身攻击”。
</p>

<p>
就是我在道理上说不过你，我还是有办法打倒你，就是给你泼脏水，说你私生活不检点等。受过逻辑训练的人会知道，一个人的言论和他的道德没有关系。反过来也一样的，不是说一个人在道德上多高尚，他说的话就对。其实古人也有这种智慧，叫“不以人废言，不以言举人”。
</p>
</div>
</div>

<div id="outline-container-org849a8f3" class="outline-2">
<h2 id="org849a8f3">以自我为中心</h2>
<div class="outline-text-2" id="text-org849a8f3">
<p>
第六种，叫“以自我为中心”。
</p>

<p>
不要和我辩论，反正我的就是对的，别人的就是错的。这个“我”可以扩大，比如只要是“我的民族”的就是对的，“我的国家”的就是对的。法西斯主义盛行时的德国和军国主义盛行时的日本，就是这样。
</p>
</div>
</div>

<div id="outline-container-org104a455" class="outline-2">
<h2 id="org104a455">过分简单</h2>
<div class="outline-text-2" id="text-org104a455">
<p>
第七种，叫“过分简单”。
</p>

<p>
世界是很复杂的，但人是很不耐烦的，你要是跟他讲复杂的道理，他不要听。所以，人天生倾向取信简单的道理。
</p>
</div>
</div>

<div id="outline-container-org0488dd3" class="outline-2">
<h2 id="org0488dd3">小结</h2>
<div class="outline-text-2" id="text-org0488dd3">
<p>
以上就是 殷海光 总结的七种谬误的种类，算是很全面了。你看，我们是不是很容易就犯错呢？
</p>

<p>
其实心智成熟的人都知道，真理是不易得的，很辛苦的。获得真理很困难，但失去真理却很容易。而且除了辛苦以外，还要用正确的方法才能获得真理。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/>
<script src="https://utteranc.es/client.js"
    repo="geekpanshi/apc"
    issue-term="pathname"
    label="apc"
    theme="github-light"
    crossorigin="anonymous"
    async>
</script>
<hr/>
<p >标题：殷海光总结的七种谬误</p>
<p class="date">日期：2024-03-25 Mon 00:00</p>
<p class="author">作者：<a href="https://nas.qysit.com:2046/geekpanshi/panshi_imgs/-/raw/main/images/about/dx17wGO.png">磐石说</a></p>
<p class="creator">© 2018 – 2023 <a href="https://github.com/geekpanshi">GeekPanshi</a> (<a href="https://www.shixingang.com/">shixingang</a>)</p>
<p class="validation"></p>
</div>
</body>
</html>
